; domain
(define (domain sokoban)
  (:requirements :typing :action-costs)
  (:types thing location direction - object
          player stone - thing)
  (:predicates (clear ?l - location)
	       (at ?t - thing ?l - location)
	       (at-goal ?s - stone)
	       (IS-GOAL ?l - location)
	       (IS-NONGOAL ?l - location)
               (MOVE-DIR ?from ?to - location ?dir - direction))
  

  (:action move
   :parameters (?p - player ?from ?to - location ?dir - direction)
   :precondition (and (at ?p ?from)
                      (clear ?to)
                      (MOVE-DIR ?from ?to ?dir)
                      )
   :effect       (and (not (at ?p ?from))
                      (not (clear ?to))
                      (at ?p ?to)
                      (clear ?from)
                      )
   )

  (:action push-to-nongoal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-NONGOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (not (at-goal ?s))
                      )
   )

  (:action push-to-goal
   :parameters (?p - player ?s - stone
                ?ppos ?from ?to - location
                ?dir - direction)
   :precondition (and (at ?p ?ppos)
                      (at ?s ?from)
                      (clear ?to)
                      (MOVE-DIR ?ppos ?from ?dir)
                      (MOVE-DIR ?from ?to ?dir)
                      (IS-GOAL ?to)
                      )
   :effect       (and (not (at ?p ?ppos))
                      (not (at ?s ?from))
                      (not (clear ?to))
                      (at ?p ?from)
                      (at ?s ?to)
                      (clear ?ppos)
                      (at-goal ?s)
                      )
   )
)

; problem
;; "svenx019"
;;
;;   # #   # #
;;  # + # # + #
;;   # $ $ $ #
;;    #     #
;;   # + $ + #
;;    # # # #

(define (problem p019-hexoban-temporal)
  (:domain sokoban)
  (:objects
    dir-east - direction
    dir-northeast - direction
    dir-northwest - direction
    dir-southeast - direction
    dir-southwest - direction
    dir-west - direction
    player-01 - player
    player-02 - player
    player-03 - player
    player-04 - player
    pos-01-01 - location
    pos-01-03 - location
    pos-01-05 - location
    pos-02-02 - location
    pos-02-04 - location
    pos-02-06 - location
    pos-03-01 - location
    pos-03-03 - location
    pos-03-05 - location
    pos-04-02 - location
    pos-04-04 - location
    pos-04-06 - location
    pos-05-01 - location
    pos-05-03 - location
    pos-05-05 - location
    pos-06-02 - location
    pos-06-04 - location
    pos-06-06 - location
    pos-07-01 - location
    pos-07-03 - location
    pos-07-05 - location
    pos-08-02 - location
    pos-08-04 - location
    pos-08-06 - location
    pos-09-01 - location
    pos-09-03 - location
    pos-09-05 - location
    pos-10-02 - location
    pos-10-04 - location
    pos-10-06 - location
    pos-11-01 - location
    pos-11-03 - location
    pos-11-05 - location
    pos-12-02 - location
    pos-12-04 - location
    pos-12-06 - location
    stone-01 - stone
    stone-02 - stone
    stone-03 - stone
    stone-04 - stone
  )
  (:init
    (IS-GOAL pos-04-02)
    (IS-GOAL pos-05-05)
    (IS-GOAL pos-09-05)
    (IS-GOAL pos-10-02)
    (IS-NONGOAL pos-01-01)
    (IS-NONGOAL pos-01-03)
    (IS-NONGOAL pos-01-05)
    (IS-NONGOAL pos-02-02)
    (IS-NONGOAL pos-02-04)
    (IS-NONGOAL pos-02-06)
    (IS-NONGOAL pos-03-01)
    (IS-NONGOAL pos-03-03)
    (IS-NONGOAL pos-03-05)
    (IS-NONGOAL pos-04-04)
    (IS-NONGOAL pos-04-06)
    (IS-NONGOAL pos-05-01)
    (IS-NONGOAL pos-05-03)
    (IS-NONGOAL pos-06-02)
    (IS-NONGOAL pos-06-04)
    (IS-NONGOAL pos-06-06)
    (IS-NONGOAL pos-07-01)
    (IS-NONGOAL pos-07-03)
    (IS-NONGOAL pos-07-05)
    (IS-NONGOAL pos-08-02)
    (IS-NONGOAL pos-08-04)
    (IS-NONGOAL pos-08-06)
    (IS-NONGOAL pos-09-01)
    (IS-NONGOAL pos-09-03)
    (IS-NONGOAL pos-10-04)
    (IS-NONGOAL pos-10-06)
    (IS-NONGOAL pos-11-01)
    (IS-NONGOAL pos-11-03)
    (IS-NONGOAL pos-11-05)
    (IS-NONGOAL pos-12-02)
    (IS-NONGOAL pos-12-04)
    (IS-NONGOAL pos-12-06)
    (MOVE-DIR pos-01-03 pos-02-04 dir-southeast)
    (MOVE-DIR pos-01-05 pos-02-04 dir-northeast)
    (MOVE-DIR pos-01-05 pos-02-06 dir-southeast)
    (MOVE-DIR pos-02-04 pos-01-03 dir-northwest)
    (MOVE-DIR pos-02-04 pos-01-05 dir-southwest)
    (MOVE-DIR pos-02-06 pos-01-05 dir-northwest)
    (MOVE-DIR pos-04-02 pos-05-03 dir-southeast)
    (MOVE-DIR pos-05-03 pos-04-02 dir-northwest)
    (MOVE-DIR pos-05-03 pos-06-04 dir-southeast)
    (MOVE-DIR pos-05-03 pos-07-03 dir-east)
    (MOVE-DIR pos-05-05 pos-06-04 dir-northeast)
    (MOVE-DIR pos-05-05 pos-07-05 dir-east)
    (MOVE-DIR pos-06-04 pos-05-03 dir-northwest)
    (MOVE-DIR pos-06-04 pos-05-05 dir-southwest)
    (MOVE-DIR pos-06-04 pos-07-03 dir-northeast)
    (MOVE-DIR pos-06-04 pos-07-05 dir-southeast)
    (MOVE-DIR pos-06-04 pos-08-04 dir-east)
    (MOVE-DIR pos-07-03 pos-05-03 dir-west)
    (MOVE-DIR pos-07-03 pos-06-04 dir-southwest)
    (MOVE-DIR pos-07-03 pos-08-04 dir-southeast)
    (MOVE-DIR pos-07-03 pos-09-03 dir-east)
    (MOVE-DIR pos-07-05 pos-05-05 dir-west)
    (MOVE-DIR pos-07-05 pos-06-04 dir-northwest)
    (MOVE-DIR pos-07-05 pos-08-04 dir-northeast)
    (MOVE-DIR pos-07-05 pos-09-05 dir-east)
    (MOVE-DIR pos-08-04 pos-06-04 dir-west)
    (MOVE-DIR pos-08-04 pos-07-03 dir-northwest)
    (MOVE-DIR pos-08-04 pos-07-05 dir-southwest)
    (MOVE-DIR pos-08-04 pos-09-03 dir-northeast)
    (MOVE-DIR pos-08-04 pos-09-05 dir-southeast)
    (MOVE-DIR pos-09-03 pos-07-03 dir-west)
    (MOVE-DIR pos-09-03 pos-08-04 dir-southwest)
    (MOVE-DIR pos-09-03 pos-10-02 dir-northeast)
    (MOVE-DIR pos-09-05 pos-07-05 dir-west)
    (MOVE-DIR pos-09-05 pos-08-04 dir-northwest)
    (MOVE-DIR pos-10-02 pos-09-03 dir-southwest)
    (at player-01 pos-04-02)
    (at player-02 pos-10-02)
    (at player-03 pos-05-05)
    (at player-04 pos-09-05)
    (at stone-01 pos-05-03)
    (at stone-02 pos-07-03)
    (at stone-03 pos-09-03)
    (at stone-04 pos-07-05)
    (clear pos-01-01)
    (clear pos-01-03)
    (clear pos-01-05)
    (clear pos-02-04)
    (clear pos-02-06)
    (clear pos-06-04)
    (clear pos-07-01)
    (clear pos-08-04)
    (clear pos-12-04)
    (clear pos-12-06)
  )
  (:goal (and
    (at-goal stone-01)
    (at-goal stone-02)
    (at-goal stone-03)
    (at-goal stone-04)
  ))
  
)

; plan
1. (move player-04 pos-09-05 pos-08-04 dir-northwest)
   deleted: (at player-04 pos-09-05) (clear pos-08-04)
   added: (at player-04 pos-08-04) (clear pos-09-05)
   goals met: 0 of 4
2. (push-to-goal player-03 stone-04 pos-05-05 pos-07-05 pos-09-05 dir-east)
   deleted: (at player-03 pos-05-05) (at stone-04 pos-07-05) (clear pos-09-05)
   added: (at player-03 pos-07-05) (at stone-04 pos-09-05) (clear pos-05-05) (at-goal stone-04)
   goals met: 1 of 4
3. (move player-03 pos-07-05 pos-05-05 dir-west)
   deleted: (at player-03 pos-07-05) (clear pos-05-05)
   added: (at player-03 pos-05-05) (clear pos-07-05)
   goals met: 1 of 4
4. (move player-04 pos-08-04 pos-06-04 dir-west)
   deleted: (at player-04 pos-08-04) (clear pos-06-04)
   added: (at player-04 pos-06-04) (clear pos-08-04)
   goals met: 1 of 4
5. (push-to-nongoal player-02 stone-03 pos-10-02 pos-09-03 pos-08-04 dir-southwest)
   deleted: (at player-02 pos-10-02) (at stone-03 pos-09-03) (clear pos-08-04)
   added: (at player-02 pos-09-03) (at stone-03 pos-08-04) (clear pos-10-02)
   goals met: 1 of 4
6. (move player-03 pos-05-05 pos-07-05 dir-east)
   deleted: (at player-03 pos-05-05) (clear pos-07-05)
   added: (at player-03 pos-07-05) (clear pos-05-05)
   goals met: 1 of 4
7. (move player-04 pos-06-04 pos-05-05 dir-southwest)
   deleted: (at player-04 pos-06-04) (clear pos-05-05)
   added: (at player-04 pos-05-05) (clear pos-06-04)
   goals met: 1 of 4
8. (push-to-nongoal player-01 stone-01 pos-04-02 pos-05-03 pos-06-04 dir-southeast)
   deleted: (at player-01 pos-04-02) (at stone-01 pos-05-03) (clear pos-06-04)
   added: (at player-01 pos-05-03) (at stone-01 pos-06-04) (clear pos-04-02)
   goals met: 1 of 4
9. (move player-01 pos-05-03 pos-04-02 dir-northwest)
   deleted: (at player-01 pos-05-03) (clear pos-04-02)
   added: (at player-01 pos-04-02) (clear pos-05-03)
   goals met: 1 of 4
10. (push-to-nongoal player-02 stone-02 pos-09-03 pos-07-03 pos-05-03 dir-west)
   deleted: (at player-02 pos-09-03) (at stone-02 pos-07-03) (clear pos-05-03)
   added: (at player-02 pos-07-03) (at stone-02 pos-05-03) (clear pos-09-03)
   goals met: 1 of 4
11. (push-to-nongoal player-03 stone-03 pos-07-05 pos-08-04 pos-09-03 dir-northeast)
   deleted: (at player-03 pos-07-05) (at stone-03 pos-08-04) (clear pos-09-03)
   added: (at player-03 pos-08-04) (at stone-03 pos-09-03) (clear pos-07-05)
   goals met: 1 of 4
12. (move player-04 pos-05-05 pos-07-05 dir-east)
   deleted: (at player-04 pos-05-05) (clear pos-07-05)
   added: (at player-04 pos-07-05) (clear pos-05-05)
   goals met: 1 of 4
13. (push-to-goal player-03 stone-03 pos-08-04 pos-09-03 pos-10-02 dir-northeast)
   deleted: (at player-03 pos-08-04) (at stone-03 pos-09-03) (clear pos-10-02)
   added: (at player-03 pos-09-03) (at stone-03 pos-10-02) (clear pos-08-04) (at-goal stone-03)
   goals met: 2 of 4
14. (push-to-goal player-02 stone-01 pos-07-03 pos-06-04 pos-05-05 dir-southwest)
   deleted: (at player-02 pos-07-03) (at stone-01 pos-06-04) (clear pos-05-05)
   added: (at player-02 pos-06-04) (at stone-01 pos-05-05) (clear pos-07-03) (at-goal stone-01)
   goals met: 3 of 4
15. (move player-02 pos-06-04 pos-08-04 dir-east)
   deleted: (at player-02 pos-06-04) (clear pos-08-04)
   added: (at player-02 pos-08-04) (clear pos-06-04)
   goals met: 3 of 4
16. (push-to-nongoal player-01 stone-02 pos-04-02 pos-05-03 pos-06-04 dir-southeast)
   deleted: (at player-01 pos-04-02) (at stone-02 pos-05-03) (clear pos-06-04)
   added: (at player-01 pos-05-03) (at stone-02 pos-06-04) (clear pos-04-02)
   goals met: 3 of 4
17. (move player-01 pos-05-03 pos-07-03 dir-east)
   deleted: (at player-01 pos-05-03) (clear pos-07-03)
   added: (at player-01 pos-07-03) (clear pos-05-03)
   goals met: 3 of 4
18. (push-to-nongoal player-04 stone-02 pos-07-05 pos-06-04 pos-05-03 dir-northwest)
   deleted: (at player-04 pos-07-05) (at stone-02 pos-06-04) (clear pos-05-03)
   added: (at player-04 pos-06-04) (at stone-02 pos-05-03) (clear pos-07-05)
   goals met: 3 of 4
19. (push-to-goal player-04 stone-02 pos-06-04 pos-05-03 pos-04-02 dir-northwest)
   deleted: (at player-04 pos-06-04) (at stone-02 pos-05-03) (clear pos-04-02)
   added: (at player-04 pos-05-03) (at stone-02 pos-04-02) (clear pos-06-04) (at-goal stone-02)
   goals met: 4 of 4
